/*迴圈
主要包含兩個主要部分 判斷是否重複執行的條件運算式 和重複執行的程式區
 當程式進入迴圈 會先經過一個判斷式 如同if判斷式 
 如果符合迴圈條件 執行其中預先設計好的迴圈區塊 
 執行完畢後 "程式流程再回到迴圈開始的地方判斷"
 這個流程會重複執行 直到迴圈判斷失敗為止 此時迴圈會終止 跳出迴圈後往下執行*/
/*當要重複執行某段程式碼 需考量
1.重複的次數→決定要使用何種迴圈  
2.執行動作停止的動機 

重複執行的次數固定→for敘述*/ 
/*for迴圈 
for(計數初始值;迴圈判斷式;改變計數)
{
	迴圈區塊程式敘述
}
for關鍵字定義迴圈所要執行的次數 結束的時機 →全指定在for()中
         {}中式迴圈每一次重複執行的內容
		 
for(計數初始值;迴圈判斷式;改變計數)  !以;區隔 
計數初始值:一段完整的運算式 初始化計數器的起始值 此運算式只會執行一次
迴圈判斷式:一組運算式 定義計數器何時停止 
		   結果是true→表示迴圈將繼續重複執行迴圈中的程式碼
		         false→跳出迴圈
改變計數:一段完整的運算式 負責改變計數器的值 通常針對計數器的值進行遞增或遞減 
 
*/ 
/*

*/
