/*變數 資料型態→提供資料存取運算
運算子→串接變數 定義具有特殊運算邏輯的運算式 構成可獨立執行的程式敘述
運算子→以特定符號表示

運算式=運算子+運算元
運算元  運算子   運算元 
x       =        100 
     設值運算 
     
程式執行的過程→各種運算子對特定運算元執行其專屬的邏輯運算作業*/

/*
設值運算子
設值運算  = 

算術運算子 
運算 運算子	例子
加法   +	i + 9  +→同時用於字串的合併運算 
減法   -	a - c
乘法   *	a * b
除法   /	x / y
餘數   %	r % s
遞增   ++	++s    ++→將運算元的值+1 
遞減   --	--s    --→將運算元的值-1 
負數   -	-s

單一字元運算子
將運算元轉換成正值  +
將運算元轉換成負值  -

關係運算子
 運算	   運算子	例子
相等	    ==   	i == 9
不等於 	    !=  	a != c
大於	    >	    a > b
小於       	<    	x < y
大於或等於	>=  	i>=0
小於或等於	<=  	i<=9

邏輯運算子
運算	運算子	例子
AND	     &&  	(x>0)&&(y>0)
OR	     ||	    (a>0)||(b>0)
NOT    	 !	    !(a>=b       !→邏輯反向運算 反轉boolean值

條件式運算子
?: →三元運算子(if-then-else的陳述式的簡寫) 
*/ 
